<?php
namespace asbamboo\qirifu\common\model\account;

/**
 * 数据表枚举字段值
 *
 * @author 李春寅 <licy2013@aliyun.com>
 * @since 2018年11月28日
 */
class Code
{
    /*********************************************************************************************************
     * type 字段
    *********************************************************************************************************/
    const TYPES             = [
        self::TYPE_ACCOUNT  => '账号',
        self::TYPE_EMAIL    => 'Email',
        self::TYPE_PHONE    => '手机号码'
    ];
    const TYPE_ACCOUNT      = '0';
    const TYPE_EMAIL        = '1';
    const TYPE_PHONE        = '2';
    /********************************************************************************************************/
}
